app/controllers/answers_controller.rb

	def create
		# render plain: params
		@answer = @question.answers.build answer_params

		if @answer.save
---
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "My first answer"], ["question_id", 3], ["created_at", "2022-04-27 23:52:07.642348"], ["updated_at", "2022-04-27 23:52:07.642348"]]

	def set_question!
		@question = Question.find params[:question_id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]