app/controllers/answers_controller.rb

UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "odpowiedżź 1234"], ["updated_at", "2022-04-29 22:16:44.495158"], ["id", 12]]
---
  def update
    if @answer.update answer_params

INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "lallala 3"], ["question_id", 4], ["created_at", "2022-04-29 22:13:47.604321"], ["updated_at", "2022-04-29 22:13:47.604321"]]
---
  def create
    # render plain: params
    @answer = @question.answers.build answer_params

    if @answer.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_question!
    @question = Question.find params[:question_id]

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 4], ["id", 12], ["LIMIT", 1]]
---
  def set_answer!
    @answer = @question.answers.find params[:id]