app/controllers/questions_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 4]]
---
	def show
		@answer = @question.answers.build
		@answers = @question.answers.order created_at: :desc

SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
	def index
		@questions = Question.order(created_at: :desc).page params[:page]