app/controllers/questions_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY "answers"."created_at" DESC LIMIT ? OFFSET ?  [["question_id", 42], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 42]]
---
	def show
		@answer = @question.answers.build
		@answers = @question.answers.order(created_at: :desc).page(params[:page]).per(2)

UPDATE "questions" SET "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["body", "<b>Bold</b> jakiś <p>paragraf</p> tam <u>UUU</u>"], ["updated_at", "2022-04-29 22:33:37.428611"], ["id", 12]]
---
	def update
		if @question.update question_params

SELECT COUNT(*) FROM "questions"
---
	def index
		#@questions = Question.order(created_at: :desc).page params[:page] # default 25
		@questions = Question.order(created_at: :desc).page(params[:page]).per(5)

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "jakiś testowaty z pogrubieniem"], ["body", "<b>Bold</b> jakiś tam <u>UUU</u>"], ["created_at", "2022-04-29 22:31:49.886581"], ["updated_at", "2022-04-29 22:31:49.886581"]]
---
	def create
		@question = Question.new question_params
		if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def set_question!
		@question = Question.find params[:id]